#include<stdio.h>

#include<stdlib.h>
#include <string.h>
#include <ctype.h>



#include <conio.h>
int b,i,j,e,n,p,o,d;
char input;
int main()
{
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	//­׃₪H₪ֶ­¶­± 

	system("pause");                
	fflush(stdin);                   
	system("CLS");               
	int password;                  
	printf("½׀¿י₪J4¦ל¼ֶ±K½X\n");
	scanf("%d",&password);          
	if (password==2024){         
		system("CLS");				 
		printf("ֵw×ן\n");
		system("pause");			 
		system("CLS");               
		printf(" _________________________\n");
		printf(" | a. µe¥X×½¨₪₪T¨₪§־     |\n");	
		printf(" | b. ֵד¥Ü­¼×k×ם         |\n");
		printf(" | c. µ²§פ               |\n");
		printf(" |_______________________|\n");
		system("pause");           
		char c;                      
		c=getchar();  
	loop1:
	fflush(stdin);
			printf("¿י₪J³ü­׃¦r₪¸\n");
			scanf("%c",&b);
			switch(b){   
			case 65:
			case 97:	
		
			system("cls");
			printf("½׀¿י₪J₪@­׃­^₪ו¦r"); 

	loop2:
	fflush(stdin);
	scanf("%c",&input);
    			if((input>=97)&&(input<=110))
    			{
					for(i=0;i<=input-97;i++){
       	 				for(j=1;j<=input-97-i;j++){
           				printf(" ");
        				}
        				for(e=0;e<=i;e++){
           					printf("%c",input-e);
        				}
        				printf("\n");
        			
    				
    			}
					getch();
    				system("CLS");
    				goto loop1;
				}else{
    				printf("¿י₪J×÷¦r₪¸₪£¦ba-n₪§¶¡¡A½׀­«·s¿י₪J\n");
    				goto loop2;
				}
				
				break;
				case 66:
    		case 98:
    loop3:
    fflush(stdin);
    scanf("%d",&n);
    			if((n>=1)&&(n<=9))
				{
					for(p=1;p<n;p++)
					{
						for(o=1;o<n;o++)
						{
							printf("p*o=%d ",p*o);
						}
						printf("\n");
					}
					getch();
					system("CLS");
				}else{
					printf("¿י₪J×÷¦r₪¸₪£¦b1-9₪§¶¡¡A½׀­«·s¿י₪J\n");
					goto loop3;
				}
				break;
				case 67:
			case 99:
				printf("Continue? (y/n)");
	loop4:
	            scanf("%c",&d);
				if((d==89)||(d==121))
				{
					goto loop1;
				}else{
					if((d==78)||(d==110))
					{
					system("pause");
					return 0;
					}else{
						printf("¿י₪J×÷₪£¬Oy©־n¡A½׀­«·s¿י₪Jn");
						goto loop4;
					}
				}
    			break;
		}
	}else{
		printf("±K½X¿ש»~\n");
	}
        		}
				
				
				
    				





























