#include<stdio.h>

#include<stdlib.h>
#include <string.h>
#include <ctype.h>



#include <conio.h>
int b,i,j,e;
char input;
int main()
{
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	//­׃₪H₪ֶ­¶­± 

	system("pause");                 //«צENTERִ~ִע§@·~ 
	fflush(stdin);                   //¨ֿ input buffer ²b×ֵ
	system("CLS");                   //²M°£­¶­± 
	int password;                    //±N PASSWORD³]¬°ֵÜ¼ֶ 
	printf("½׀¿י₪J4¦ל¼ֶ±K½X\n");
	scanf("%d",&password);           //­n¨D¿י₪J10¶i¦ל¼ֶ¦r 
	if (password==2024){             //±K½X³]¬°2024
		system("CLS");				 //²M°£­¶­± 
		printf("ֵw×ן\n");
		system("pause");			 //«צENTERִ~ִע§@·~ 
		system("CLS");               //²M°£­¶­± 
		printf(" _________________________\n");
		printf(" | a. µe¥X×½¨₪₪T¨₪§־     |\n");	
		printf(" | b. ֵד¥Ü­¼×k×ם         |\n");
		printf(" | c. µ²§פ               |\n");
		printf(" |_______________________|\n");
		system("pause");            //«צENTERִ~ִע§@·~ 
		char c;                     //±Nc³]¬°¦r₪¸ֵÜ¼ֶ   
		c=getchar();  
	loop1:
	fflush(stdin);
			printf("¿י₪J³ü­׃¦r₪¸\n");
			scanf("%c",&b);
			switch(b){   
			case 65:
			case 97:	
		
			system("cls");
			printf("½׀¿י₪J₪@­׃­^₪ו¦r"); 

	loop2:
	fflush(stdin);
	scanf("%c",&input);
    			if((input>=97)&&(input<=110))
    			{
					for(i=0;i<=input-97;i++){
       	 				for(j=1;j<=input-97-i;j++){
           				printf(" ");
        				}
        				for(e=0;e<=i;e++){
           					printf("%c",input-e);
        				}
        				printf("\n");
        			
    				
    			}
					getch();
    				system("CLS");
    				goto loop1;
				}else{
    				printf("¿י₪J×÷¦r₪¸₪£¦ba-n₪§¶¡¡A½׀­«·s¿י₪J\n");
    				goto loop2;
				}
				
				break;
        		}
				}
				}
