#include<stdio.h>

#include<stdlib.h>
#include <string.h>
#include <ctype.h>



#include <conio.h>
void displayTriangle(char ch) {
    system("cls");
    int rows = ch - 'a' + 1;


}
int main()
{
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	printf("שבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששבשששב\n");
	//­׃₪H₪ֶ­¶­± 

	system("pause");                 //«צENTERִ~ִע§@·~ 
	fflush(stdin);                   //¨ֿ input buffer ²b×ֵ
	system("CLS");                   //²M°£­¶­± 
	int password;                    //±N PASSWORD³]¬°ֵÜ¼ֶ 
	printf("½׀¿י₪J4¦ל¼ֶ±K½X\n");
	scanf("%d",&password);           //­n¨D¿י₪J10¶i¦ל¼ֶ¦r 
	if (password==2024){             //±K½X³]¬°2024
		system("CLS");				 //²M°£­¶­± 
		printf("ֵw×ן\n");
		system("pause");			 //«צENTERִ~ִע§@·~ 
		system("CLS");               //²M°£­¶­± 
		printf(" _________________________\n");
		printf(" | a. µe¥X×½¨₪₪T¨₪§־     |\n");	
		printf(" | b. ֵד¥Ü­¼×k×ם         |\n");
		printf(" | c. µ²§פ               |\n");
		printf(" |_______________________|\n");
		system("pause");            //«צENTERִ~ִע§@·~ 
		char c;                     //±Nc³]¬°¦r₪¸ֵÜ¼ֶ   
		c=getchar();                //¦r₪¸¿י₪J
			printf("¿י₪J³ü­׃¦r₪¸\n");
			c=getchar();
			if (c=='a'||c=='A'){    //c¬°0~9¿י¥Xdigit 
			char input;
			system("cls");
			printf("½׀¿י₪J₪@­׃­^₪ו¦r"); 
			
			input=getchar();
	
				if (input<'a'||input>'n'){
					printf("error\n");
					

//			else if (c=='b'||c=='B'){//c¬°a~z¿י¥Xlowercase 
//				printf("Lowercase\n");
////		}
	//		else if (c=='c'||c=='C'){//c¬°A~Z¿י¥XUPPERCASE 
	//			printf("Uppercase\n");
	//	}
	//		else{                   //c¬°¨ה¥L¦r²ֵ¿י¥X¦Û₪v×÷¦W¦r 
	//		 	printf("E1B13³¯«ה·½\n");
//		}
			
	}
	else if
	printf("%c",&input);

	else {                          //±K½X¿י₪J₪£¬°2024±N°ץ¦ז¦¹±¡×p 
		printf("WARNING\n");         
		printf("%c",'\a');
		printf("¿י₪J¿ש»~\n\a");

		
	return 0;
	}


}
}
}
//§Ú×ב₪F¥|₪ׁ₪ְ§ו°µ§¹³o­׃µ{¦¡²{¦b¥uִ±±o±ֶ×©¬O³ּ³ֲ·׀×÷³¡₪ְ §Ú¥uִ±±o¦n²ײ ¦³¨ַ×F¦טֱÙ¬O¥h÷פ¸פ₪W¬d×÷¥i¯א₪W½ׂ¦³±׀©־³\§Ú§ׁ₪F 
//ֱ`₪§³ּ³ֲ·׀×÷³¡₪ְ§Úִ±±o¬O±ֶ×© ₪@°ן²ֵ¸¹¥X₪£¨׃ ₪@°ןֳC₪ו¦rµL×k¨ֿ¥־ ®t₪£¦h´N³o¼ֻ 

























